{"pageProps":{"post":{"title":"Software... Engineering?","slug":"blog/2010-09-27-software-engineering","datePublished":"2010-09-27T00:00:00.000Z","mdx":{"compiledSource":"var d=Object.defineProperty,u=Object.defineProperties;var c=Object.getOwnPropertyDescriptors;var a=Object.getOwnPropertySymbols;var i=Object.prototype.hasOwnProperty,n=Object.prototype.propertyIsEnumerable;var l=(e,t,o)=>t in e?d(e,t,{enumerable:!0,configurable:!0,writable:!0,value:o}):e[t]=o,s=(e,t)=>{for(var o in t||(t={}))i.call(t,o)&&l(e,o,t[o]);if(a)for(var o of a(t))n.call(t,o)&&l(e,o,t[o]);return e},h=(e,t)=>u(e,c(t));var b=(e,t)=>{var o={};for(var r in e)i.call(e,r)&&t.indexOf(r)<0&&(o[r]=e[r]);if(e!=null&&a)for(var r of a(e))t.indexOf(r)<0&&n.call(e,r)&&(o[r]=e[r]);return o};const layoutProps={},MDXLayout=\"wrapper\";function MDXContent(o){var r=o,{components:e}=r,t=b(r,[\"components\"]);return mdx(MDXLayout,h(s(s({},layoutProps),t),{components:e,mdxType:\"MDXLayout\"}),mdx(\"p\",null,'If all engineers worked the way \"software engineers\" do...',mdx(\"br\",null),mdx(\"br\",null),\"Al: OK guys, we need to build a bridge across this river. The roads are ready on each side, we just need the bridge now. It has to have two lanes, and support vehicles up to 12 tons. Let's make a plan.\",mdx(\"br\",null),mdx(\"br\",null),\"Bill: That's easy - just give me a hammer and a box of nails. I'll be done in two weeks if everyone stays out of my way.\",mdx(\"br\",null),mdx(\"br\",null),\"Carl: No, no, we need to start by engaging the customer and starting to flesh out the user stories.\",mdx(\"br\",null),mdx(\"br\",null),`Bill: Here's a story for you: \"Old lady drives into river because dumbass engineer took too long to build a bridge\".`,mdx(\"br\",null),mdx(\"br\",null),\"Doug: No, we should start by defining a set of well-defined interfaces between the components of the bridge - the frame-to-road-surface interface, the road-to-car interface...\",\"\\xA0\",\" Then we should look at building some factories for each of those components - abstract factories, actually.\",\"\\xA0\",\" Then when someone wants to drive across, they just have to sign the contract stating that they will conform to the vehicle-side interface contract...\",mdx(\"br\",null),mdx(\"br\",null),\"Eric: Forget all that enterprise bridge-building crap - that's so last year. There's this cool new open-source bridge-building framework that makes the whole thing out of bamboo and twine in less than a minute. It's so cool. Apparently its strength is unproven on bridges over 12 inches in length, but I'm sure it will work out...\",mdx(\"br\",null),mdx(\"br\",null),\"Al: Ok, ok, it sounds like we've got some ideas flowing. I'll let you guys get to it.\",mdx(\"br\",null),mdx(\"br\",null),\"6 Months Later\",mdx(\"br\",null),mdx(\"br\",null),\"Al: What the hell is going on with this bridge? We were supposed to be done in two months.\",mdx(\"br\",null),mdx(\"br\",null),\"Eric: My part is done! The western half of the support structure was done last month, and the bamboo is holding up nicely. It hasn't fallen down again in weeks now.\",mdx(\"br\",null),mdx(\"br\",null),\"Bill: My part is pretty much done...\",mdx(\"br\",null),mdx(\"br\",null),\"Al: Pretty much done? You said it would take two weeks, remember that?\",mdx(\"br\",null),mdx(\"br\",null),\"Bill: Yeah, but I had to change the plans and use metal instead of wood, and it took me a while to perfect my alloy...\",mdx(\"br\",null),mdx(\"br\",null),\"Al: Your alloy?!?\",mdx(\"br\",null),mdx(\"br\",null),\"Bill: Yes, it's custom made just for this bridge. But it's taking a while to retool my steel mill.\",mdx(\"br\",null),mdx(\"br\",null),\"Al: You built your own steel mill? What the hell?\",mdx(\"br\",null),mdx(\"br\",null),\"Bill: Of course. It also takes time to ship the ore from my mine...\",mdx(\"br\",null),mdx(\"br\",null),\"Al: (shaking head) And what's up with the road surface? It looks like it's made of two-by fours.\",mdx(\"br\",null),mdx(\"br\",null),\"Doug: Yes, but that's just the default road surface that you get out-of-the-box. You can configure that arbitrarily at drive-time by injecting an appropriate implementation of the road-to-frame interface into the bridge configuration...\",mdx(\"br\",null),mdx(\"br\",null),\"Al: And the railings? Why aren't they done?\",mdx(\"br\",null),mdx(\"br\",null),\"Carl: There was insufficient evidence from the user-stories I collected over the last 5 months to support the effort required, so we de-scoped them.\",mdx(\"br\",null),mdx(\"br\",null),\"Al: (sigh) Is there anything else I should know?\",mdx(\"br\",null),mdx(\"br\",null),\"Eric: Well, I'm not too happy with the test coverage...\",mdx(\"br\",null),mdx(\"br\",null),\"Al: I have an idea for testing. You four get in a dumptruck and drive across. I'll wait here.\"))}MDXContent.isMDXComponent=!0;\n"}}},"__N_SSG":true}